Autodesk.Revit.DB.Structure.RebarHostData.GetRebarContainersInHost
Returns all RebarContainer elements hosted by the referenced element.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2016

Autodesk.Revit.DB.Structure.RebarHostData.GetFabricAreasInHost
Returns all FabricArea elements hosted by the referenced element.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2013

Autodesk.Revit.DB.Structure.RebarHostData.GetFabricSheetsInHost
Returns all FabricSheet elements hosted by the referenced element.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2015

Autodesk.Revit.DB.Structure.RebarHostData.GetPathReinforcementsInHost
Returns all PathReinforcement elements hosted by the referenced element.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.GetAreaReinforcementsInHost
Returns all AreaReinforcement elements hosted by the referenced element.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.GetRebarsInHost
Returns all Rebar elements hosted by the referenced element.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.SetCommonCoverType(Autodesk.Revit.DB.Structure.RebarCoverType)
Associate a single CoverType with all exposed faces of the host element.
coverType:
A CoverType object to be applied to all faces.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.GetCommonCoverType
If all exposed faces of the host have the same associated CoverType,
return that CoverType; otherwise, return null.
Returns:
The common CoverType for all exposed faces, or null
if there are multiple CoverTypes.
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.SetCoverType(Autodesk.Revit.DB.Reference,Autodesk.Revit.DB.Structure.RebarCoverType)
Associates the specified CoverType with the specified face of the element.
Throws Autodesk.Revit.Exceptions.ArgumentException:
In this element, face does not have an associated CoverType, because
it is not exposed.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarHostData.GetCoverType(Autodesk.Revit.DB.Reference)
Gets the CoverType associated with a face of the element.
Returns:
The cover associated with the face, if it is an exposed face.
If the face is concealed, returns null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.DB.Structure.RebarHostData.IsFaceExposed(Autodesk.Revit.DB.Reference)
Checks whether the specified face is considered exposed, and
therefore has an associated CoverType.
Remarks:
This method replaces the method HasCoverTypeForReference() from
the 2011 Revit API.
Returns:
True if %face% is exposed, false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.GetExposedFaces
Returns all the exposed faces, that is, those that have an associated CoverType.
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.IsValidHost(Autodesk.Revit.DB.Element)
Identifies whether a given element can host reinforcement.
Remarks:
Many different elements are permitted to host reinforcement,
for example, beams, walls, columns, or parts.
Often there are specific restrictions about whether an element
can host rebar beyond its type or category.
For example, the material type of the element may determine this.
Or for parts, the part must have been created from layers
that have their function set to Structure.
element:
The element to check.
Returns:
True if the input Element can host reinforcement elements,
false otherwise.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2015

Autodesk.Revit.DB.Structure.RebarHostData.IsValidHost
Reports whether the element is a valid rebar host.
Remarks:
If GetRebarHostData() returns a RebarHostData object,
but RebarHostData.IsValidHost() returns false, this means
that the element can be made
a valid rebar host, generally by setting a property
like FLOOR_PARAM_IS_STRUCTURAL or by changing the
element's physical material to concrete. On the other
hand, if GetRebarHostData() returns null, the element
cannot be made into a rebar host. This method replaces the Valid
property from the 2011 Revit API.
Returns:
True if the referenced Element can currently host Rebar elements,
false otherwise.
Since:
2012

Autodesk.Revit.DB.Structure.RebarHostData.GetRebarHostData(Autodesk.Revit.DB.Element)
Gets a RebarHostData object referring to the specified
rebar host element.
Remarks:
Returns null for elements that cannot ever be rebar hosts,
such as levels.
host:
An element to host rebar.
Returns:
A RebarHostData object, or null.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
None of the following disciplines is enabled: Structural.

Autodesk.Revit.DB.Structure.RebarHostData.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.Structure.RebarHostData
Interface to rebar-specific data stored in each valid rebar host element.
Remarks:
Rebar host elements keep track of the "exposed faces," those that are not completely
concealed by another rebar host. Faces may be concealed by joins; for instance,
the top face of a beam that supports a slab is concealed. Faces can also be concealed
by adjacency; for instance, the bottom face of a column that is supported by a
foundation. Each exposed face of a rebar host must have a valid CoverType associated
with it.
Rebar hosts also have cover parameters, providing a limited interface
to the GetCoverType and SetCoverType
methods.
Each parameter simply gets or sets the cover setting associated with one or more
particular faces of the host.
CLEAR_COVER_EXTERIOR (walls only)
CLEAR_COVER_INTERIOR (walls only)
CLEAR_COVER_OTHER    (all hosts except in-place families and stairs)
CLEAR_COVER          (in-place families and stairs)
CLEAR_COVER_TOP      (all hosts except walls, in-place families, and stairs)
CLEAR_COVER_BOTTOM   (all hosts except walls, in-place families, and stairs)